--*********************************************************************
-- 版权所有:(C)2005, 中兴通讯股份有限公司
-- 数据库版本:Sybase ASE Enterprise 12.0
-- 内容摘要:1000号业务的存储过程脚本文件 
-- 作    者:dxm
-- 完成日期:2005.03.23
-- 修改记录1： 
--    修改日期：
--    版 本 号：
--    修 改 人：
--    修改内容：
-- 修改记录2：
--**********************************************************************


--**************************************************
--  initialization  初始化             
--**************************************************

use zxdb_1000
go
-- 清除日志
dump tran zxdb_1000 with no_log
go

--************************************************************
--  user and right creation 用户及权限的建立       
--************************************************************

--***********************************************************************
--  table creation    数据表的创建       
--***********************************************************************

--**************************************************
--  procedure creation       存储过程的创建
--**************************************************

--写日志存储过程
--输入参数：v_flowno 呼叫流水号，v_starttime 呼叫开始时间，v_endtime 呼叫结束时间
--输出参数：无
print    'pr_call_writelog'
go
if exists (select 1 from sysobjects where id = object_id('pr_call_writelog')) 
    drop procedure pr_call_writelog  
go
create procedure pr_call_writelog(	 
    @v_flowno     varchar(20),           --呼叫流水号
    @v_starttime  varchar(20),           --呼叫开始时间
    @v_endtime    varchar(20)            --呼叫结束时间
)  
as
begin
    ...
end
go

--**************************************************
--  task creation       数据库任务的创建        
--**************************************************

--**************************************************
--  finalization     结束        
--**************************************************
use zxdb_1000
go
dump tran zxdb_1000 with no_log
go


